<p>
    Придбати практичні навички роботи з селекторами,ідентифікаторами, списками, різноманітними властивостями кольору і
    фону, зовнішними та внутрішними відступами, плаваючими елементами, оформленням текстових елементів, 4 методами
    визначення таблиці стилів.
</p>
<ol>
    <li>
        У власному сайті, на свій розсуд, застосувати 4 методи визначення таблиці стилів:
        <ul>
            <li>Зв'язування (linking)</li>
            <li>Вбудовування (embeding)</li>
            <li>Вкладення (inline)</li>
            <li>Імпорт (import) (IE)</li>
        </ul>
    </li>
    <li>
        Відобразити самі HTML-коди 4-х методів визначення CSS і результати їх виконання - у звітному HTML-документі.
    </li>
    <li>
        У HTML-коді власного сайту, на свій розсуд, застосувати селектори тегу і класу. Вміти пояснити викладачу.
        HTML-коди даного пункту і результати їх виконання - відобразити у звітному HTML-документі.
    </li>
    <li>
        У HTML-коді власного сайту, на свій розсуд, застосувати ідентифікатори. Вміти пояснити викладачу. HTML-коди
        даного пункту і результати їх виконання - відобразити у звітному HTML-документі.
    </li>
    <li>
        На свій розсуд застосувати сосідні, дочерні селектори, селектор атрибута та універсальний селектор. Програмні
        коди та результат виконання даного пункту - відобразити у звітному HTML-документі.
    </li>
    <li>
        За допомогою каскадних таблиць стилів виконати, на свій розусуд , стильове оформлення текстовіх елементів,
        застосовуючи різноманітні властивості кольору і фону.
    </li>
    <li>
        Показати як оформлюються:
        <ul>
            <li>списки</li>
            <li>зовнішні та внутрішні відступи (зовнішні відступ показати на двох блочних елементах)</li>
            <li>плаваючі елементи</li>
        </ul>
    </li>
    <li>
        HTML-коди пункту №7 відобразити у звітному HTML-документі.
    </li>
</ol>
