<p>Придбати практичні навички роботи з html-документом, таблицями,формами, зображеннями, посиланнями</p>
<p>Розробити сайт інтернет-магазина смартфонів.</p>

<ol>
    <li>
        Підготувати шаблон майбутнього звітного HTML-документу на 9 лабораторних робіт та розмістити у папці на
        Гугл-Диску. Результати виконання кожної нової лабораторної роботи будуть добавлятись у цей HTML-документ.
    </li>

    <li>
        На свій розсуд вибрати любу предметну галузь і виконати опис цієї галузі, а саме: опис бізнес-логіки системи
        (функціонал майбутньої програми) , сценарій, об’екти взаимодії. Опис предметної області розмістити у звітному
        HTML-документі.( див. Додаток1).
    </li>

    <li>
        Вибрати на свій розсуд середовище розробки майбутнього сайту. Написати в ньому HTML-коди головної сторінки та
        інших WEB-сторінок сайту (застосунку), на яких розмістити на свій розсуд наступні елементи:
        <ul>
            <li>посилання на будь-яку WE B-сторінку;</li>
            <li>таблицю;</li>
            <li>форму;</li>
            <li>зображеня (або декілька зображень);</li>
            <li>заголовки;</li>
            <li>інші елементи HTML-документу ( за бажанням)</li>
        </ul>
    </li>

    <li>
        Запустити даний документ у любому браузері для перевірки виведення елементів WEB-сайту (іноді його будемо
        називати просто HTML-документ, який буде містити визначену кількість WEB-сторінок).
    </li>

    <li>
        У звітному HTML-документі розмістити результати виконання лабораторної роботи №1 ( див. Додаток1), а саме:
        <ul>
            <li>Тема та постановка задачі лабораторної роботи №1;</li>
            <li>Середовище розробки сайту. Місце розташування сайту;</li>
            <li>Зовнішний вигляд сайту. НТМL-коди файлів.</li>
            <li>HTML-код ТАБЛИЦЬ – скриншот результатувиведення таблиці ;</li>
            <li>HTML-код ФОРМИ;</li>
            <li>HTML-код ЗОБРАЖЕННЯ;</li>
            <li>Використана література, сайти, при виконанні лабораторної роботи №1;</li>
            <li>ВИСНОВКИ.</li>
        </ul>
    </li>
</ol>
