<h3>Мета</h3>
<p>
    придбати практичні навички роботи jQuery UI, вміти додавати до сайту динамічні елементи цієї бібіліотеки, плагін
    галереї UniteGallery, кнопки соціальних мереж, інформери та інше.
</p>

<h3>Задача</h3>

<ol>
    <li>Ознайомитися з теоретичними відомостями до лабораторної роботи №5 ( бібліотека jQuery UI). Теоретичні відомості
        надані у даному файлі стор.6 (прогорнути)
    </li>


    <li>Відкрити власний сайт або створити окремо WEB-строрінку, якщо елементи (пункт 3)не заплановано використовувати у
        власній программі( сайті).
    </li>


    <li>Користуючись документацією бібліотеки https://jqueryui.com/ додати до сайту (або до окремої сторінки) 3
        динамічних
        елементи, що наведені в переліку:
        <ul>
            <li>Accordion - набір елементів, що розгортаються/згортаються.</li>
            <li>Datepicker - вибір дати з календаря.</li>
            <li>Menu – випадне меню.</li>
            <li>Slider - вибір числа за допомогою повзунка.</li>
            <li>Tabs - організація вкладок на сторінці.</li>
            <li>Tooltip - організація спливаючих підказок.</li>
        </ul>
    </li>


    <li>Додати до сайту (або до окремої сторінки) плагін галереї UniteGallery. Створити за допомогою бібліотеки:
        фотогалерею з можливістю перегляду збільшених зображень
        слайдер фотографій
        слайдер відеоматеріалів
    </li>


    <li>Додати до сайту (або до окремої сторінки) кнопки соціальних мереж: Facebook, Twitter, Instagram, Pinterest.</li>


    <li>Додати сайту (або до окремої на сторінці) інформери:
        <ul>
            <li>Погода у Києві ( або у іншому місці)</li>
            <li>Курс валют</li>
            <li>Годинник</li>
        </ul>
    </li>
    <li>Додати сайту (або до окремої на сторінці) один (або більше) із модулів jQuery для мультимедіа (зображення і відео).
        Список модулів дивитись в теоретичних відомостях.</li>

    <li>У звітному HTML-документі оформити звіт лабораторної роботи №5</li>
</ol>
