<p>
    <b>Мета:</b> придбати практичні навички роботи маніпулювання інформаційним вмістом Web-документа засобами мови
    JavasScript, використання об’єктів,масивів, функцій, подій, обробників подій у сценаріях на мові JavasScript.
</p>

<ol>
    <li>У звітному HTML-документі розмістити тему та постановку задачі лабораторної роботи №4.</li>

    <li>У власному сайті або на окремій WEB-сторінці, використовучі функції , застосувати 4 способи функціонального
        застосування JavaScript:
        <ul>
            <li>гіпертекстове посилання (схема URL);</li>
            <li>обробник події (handler);</li>
            <li>підстановка (entity);</li>
            <li>вставка (тег SCRIPT).</li>
        </ul>
    </li>

    <li>Розмістити результати виконання та програмний код 2 пункту у звітному HTML-документі, записавши назви файлів
        HTML-документів.
    </li>

    <li>
        Використовуючі сценарій на JavaScript, виконати завдання. яке приведене у Таблиці №1. <b>Кожному студенту
        виконати своє завдання.</b> Номер варіанта відповідає останій цифрі студента у списку групи. Наприклад, Студент
        18 за списком – буде виконувати 8 варіант

        <table>
            <thead>
            <tr>
                <th>№ варіантів</th>
                <th>Завдання</th>
            </tr>
            </thead>
            <tbody>
            <tr>
                <td>1</td>
                <td>
                    <p>
                        Створити одновимірний массив, кількість елементів якого задана користувачем. Знайти максимальний
                        серед парних елементів та мінімальний серед елементів з парними індексами. В масиві поміняти
                        місцями знайдені максимальний та мінімальний елементи, надрукувати вхідний та вихідний масиви.
                    </p>
                    <p>Виконати сортування вихідного масиву за зростанням методом <b>вставки</b>.</p>
                    <p>Застосувати функції</p>
                </td>
            </tr>
            <tr>
                <td>2</td>
                <td>
                    <p>
                        Створити одновимірний массив, кількість елементів якого задана користувачем. Знайти суму
                        елементів з парними індексами, добуток від’ємних елементів, максимальний елемент та його індекс
                        серед додатних чисел, мінімальний елемент та його індекс серед елементів зх непарними індексами.
                    </p>
                    <p>Упорядкувати масив у порядку зростання, Надрукувати вхідний та вихідний масив.</p>
                    <p>Застосувати функції</p>
                </td>
            </tr>
            <tr>
                <td>3</td>
                <td>
                    <p>
                        Заданий одновимірний масив А, кількість елементів якого задана користувачем. Побудувати масив В,
                        кожний елемент якого обчислюється за формулою: bі = max*ai де - max це максимальний елемент
                        масиву А. Надрукувати вхідний та вихідний масиви.
                    </p>
                    <p>Виконати сортування вихідного масиву за зменшенням методом <b>вставки</b></p>
                    <p>Застосувати функції</p>
                </td>
            </tr>
            <tr>
                <td>4</td>
                <td>
                    <p>
                        Задані одновимірні масиви А, В з 10 чисел. Побудувати масив С, кожний елемент якого обчислюється
                        за формулою:
                    </p>
                    <p>
                        В масиві С поміняти максимальний елемент і перший. Вивести масиви до переставлення елементів та
                        після.
                    </p>
                    <p>
                        Упорядкувати масив у порядку зростання методом бульбашки. Надрукувати вхідний та вихідний масив.
                    </p>
                    <p>Застосувати функції</p>
                </td>
            </tr>
            <tr>
                <td>5</td>
                <td>
                    <p>
                        Створити одновимірний массив, кількість елементів якого задана користувачем. Визначити
                        максимальне та мінімальне значення серед елементів із парними та непарними номерами.
                    </p>
                    <p>
                        Упорядкувати масив у порядку зменшення методом <b>вибору</b>. Надрукувати вхідний та вихідний
                        масив.
                    </p>
                    <p>Застосувати функції</p>
                </td>
            </tr>
            <tr>
                <td>6</td>
                <td>
                    <p>
                        Створити одновимірний массив, кількість елементів якого задана користувачем. Обчислити суму
                        елементів між максимальним та мінімальними значеннями масиву.
                    </p>
                    <p>
                        Упорядкувати масив у порядку зростання (метод <b>швидкого</b> сортування). Надрукувати вхідний
                        та вихідний масив.
                    </p>
                    <p>Застосувати функції</p>
                </td>
            </tr>
            <tr>
                <td>7</td>
                <td>
                    <p>
                        Створити одновимірний массив. Знайти найбільший серед від’ємних та найменший серед додатних
                        елементів масиву.
                    </p>
                    <p>
                        Упорядкувати масив у порядку зменшення методом <b>вибору</b>. Надрукувати вхідний та вихідний
                        масив.
                    </p>
                    <p>Застосувати функції</p>
                </td>
            </tr>
            <tr>
                <td>8</td>
                <td>
                    <p>
                        Створити два одновимірних массивів, кількість елементів яких задана користувачем. Знайти
                        найменший серед тих елементів першого вектора, які співпадають із значеннями елементів другого
                        вектора.
                    </p>
                    <p>
                        Упорядкувати масив у порядку зростання методом <b>бульбашки</b>. Надрукувати вхідний та вихідний
                        масив.
                    </p>
                    <p>Застосувати функції</p>
                </td>
            </tr>
            <tr>
                <td>9</td>
                <td>
                    <p>
                        Заданий масив цілих чисел. Побудувати новий масив, в якому спочатку стоять числа, що діляться на
                        2, потім ті, що діляться на 2 та 3, потім на 3. Надрукувати вхідний та вихідний масиви.
                    </p>
                    <p>
                        Упорядкувати масив у порядку зростання (метод <b>швидкого</b> сортування). Надрукувати вхідний
                        та вихідний масив.
                    </p>
                    <p>Застосувати функції</p>
                </td>
            </tr>
            <tr>
                <td>10</td>
                <td>
                    <p>
                        Згенерувати значення елементів одновимірного масиву за допомогою генератора псевдовипадкових
                        чисел, задавши кількість елементів масиву з клавіатури. Знайти мінімальний за значенням елемент
                        і записати його на початок масиву, вивільнивши для нього місце шляхом зсуву елементів масиву
                        вправо
                    </p>
                    <p>
                        Упорядкувати масив у порядку зменшення методом вибору. Надрукувати вхідний та вихідний масив.
                    </p>
                    <p>Застосувати функції</p>
                </td>
            </tr>
            </tbody>
        </table>
    </li>
    <li>
        Розмістити результат виконання та програмний код 4 пункту у звітному HTML-документі.
    </li>
    <li>
        Забезпечити виконання завдання згідно із варіантом (Таблиця №2), сформувати необхідні дані, вбудовані у
        програму, у вигляді масивів, виконати тестування програми.<br/>
        <b>Кожному студенту виконати своє завдання.</b> Номер варіанта відповідає останій цифрі студента у списку групи.
        Наприклад, Студент 18 за списком – буде виконувати 8 варіант

        <table>
            <thead>
            <tr>
                <th>№</th>
                <th>Назва завдання</th>
                <th>Примітки</th>
            </tr>
            </thead>
            <tbody>
            <tr>
                <td>1</td>
                <td>Валідація HTML-форми реєстрації користувача</td>
                <td>
                    Забезпечити перевірку елементів HTML-форми таких видів: ціле число, дійсне число, дата у форматі
                    DD.MM.YYYY, однаковість даних у полях уведення паролю (основне та перевірочне). Крім того,
                    забезпечити перевірку уведення обов‘язкових полів, помічених (*).
                </td>
            </tr>
            <tr>
                <td>2</td>
                <td>Динамічне меню</td>
                <td>
                    Сформувати багаторівневе меню (горизонтальне та вертикальне), пункти меню взяти із статичного
                    масиву. При натисканні на визначений пункт меню має завантажуватися відповідна HTML-сторінка. Меню
                    має бути присутнім на усіх сторінках.
                </td>
            </tr>
            <tr>
                <td>3</td>
                <td>Калькулятор</td>
                <td>
                    Реалізувати калькулятор мовою JavaScript. Обов‘язкові операції: +,-,*,/,%, корінь квадратний, x^y.
                    Кнопки з цифрами та знаками операцій мають бути доступні у інтерфейсі вікна.
                </td>
            </tr>
            <tr>
                <td>4</td>
                <td>Текстовий редактор</td>
                <td>
                    Реалізувати редактор, який би дозволяв виконувати форматування тексту, який уводиться. Обов‘язкові
                    елементи форматування: напівжирність, нахил, підкреслювання, колір тексту, регістр символів.
                    Елементи форматування мають бути доступними через відповідні кнопки, форматований текст – у окремому
                    вікні на сторінці.
                </td>
            </tr>
            <tr>
                <td>5</td>
                <td>Слайд-шоу</td>
                <td>
                    Реалізувати можливість перегляду зображень за таймером, врахувати можливість налаштування розміру
                    зображень, циклічність перегляду, а також часу між переключеннями.
                </td>
            </tr>
            <tr>
                <td>6</td>
                <td>Календар</td>
                <td>
                    Реалізувати можливість вибору дати у елемент форми з спеціального візуального компоненту. Вимоги до
                    компоненту: вибір числа, перехід між місяцями та роками, відміна вибору дати.
                </td>
            </tr>
            <tr>
                <td>7</td>
                <td>Гістограма</td>
                <td>
                    Реалізувати можливість уведення довільної кількості чисел у елементи форми та побудови
                    нормалізованої за максимальним числом гістограми значень цих полів. При візуалізації гістограми
                    використовувати лише засоби CSS.
                </td>
            </tr>
            <tr>
                <td>8</td>
                <td>Будильник</td>
                <td>
                    Реалізувати програму-будильник. Основні функції: увімкнення-вимкнення, уведення дати та часу.
                    Врахувати можливість включення довільної кількості будильників, а також перегляд «заведених
                    будильників». При досягненні часу спрацьовування, заданого для будильника, видавати повідомлення.
                </td>
            </tr>
            <tr>
                <td>9</td>
                <td>Візуальний елемент "Підказка при уведенні"</td>
                <td>
                    Надати можливість виведення підказки при наборі тексту у елемент уведення «текстове поле».
                    Передбачити можливість створення списку слів-підказок.
                </td>
            </tr>
            <tr>
                <td>10</td>
                <td>Візуальний елемент "Спливаюча підказка"</td>
                <td>
                    Надати можливість виведення спливаючої підказки при наведенні миші над текстом Web-сторінки.
                    Передбачити можливість створення нових підказок та їх підключення до обраного фрагменту тексту.
                </td>
            </tr>
            </tbody>
        </table>
    </li>
    <li>
        Розмістити результат виконання та програмний код 6 пункту у звітному HTML-документі.
    </li>
    <li>
        У власному сайті на свій розсуд застосувати сценарії на JavaScript. Продемонструвати викладачу та відобразити у
        звітному HTML-документі.
    </li>
    <li>
        У звітному HTML-документі оформити звіт лабораторної роботи №4.
    </li>
</ol>
